#include <iostream>

using namespace std;

int main()
{
	setlocale(LC_ALL, "Russian");
	int end;
//homework
/*Задача: В школе решили набрать три новых математических класса. Так как занятия по математике у них проходят в одно и то же время,
было решено выделить кабинет для каждого класса и купить в них новые парты. За каждой партой может сидеть не больше двух учеников.
Известно количество учащихся в каждом из трёх классов. Сколько всего нужно закупить парт чтобы их хватило на всех учеников?
Программа получает на вход три натуральных числа: количество учащихся в каждом из трех классов.
	int a, b, c, end;
	cout << "введите количество парт в первом классе: ";
	cin >> a; cout << endl;
	cout << "введите количество парт во втором классе: ";
	cin >> b; cout << endl;
	cout << "введите количество парт в третьем классе: ";
	cin >> c; cout << endl;
	cout << "общее колличество учеников: " << a + b + c << endl << "Общее количество парт: " << (a + b + c + 1) / 2 << endl;
	cin >> end;*/
	//classwork
	//task1
	/*
	int n, k;
	cout << "Введите колличество школьников: "; cin >> n; cout << endl << "Введите количество яблок в корзинке: "; cin >> k; cout << endl;
	cout << "Каждый школьник получит " << k / n << " яблок" << endl << "В корзинке останется " << k % n << " яблок";*/
	//task2
	/*
	int speed1, speed2, distance, time;
	cout << "введите скорость первого автомобиля: "; cin >> speed1; cout << endl;
	cout << "введите скорость второго автомобиля: "; cin >> speed2; cout << endl;
	cout << "введите время поездки автомобилей: "; cin >> time; cout << endl;
	cout << "так же введите начальную дистанцию между автомобилями в киллометрах: "; cin >> distance; cout << endl;

	cout << "дистанция между автомобилями через " << time << " часов, равно " << (distance + (speed1 + speed2) * time) * 1000 << " метров." << endl;
	*/


	cin >> end;
	return 0;
}
